#문제1
# 1~30 으로 구성되는 벡터에서 중복을 허용하여 10개의 값을 추출하여 v1 을 만든다.
v1 <- sample(1:30, 10, replace=T)

# 각 원소마다 “z”, “y”, “x”, “w”, “v”, “u”, “t”, “s”, “r”, “q” 라는 이름을 부여하여 네임벡터를 생성하여 v2 를 만든다.
names(v1) <- c('z','y','x','w','v','u','t','s','r','q') #letters[26:17]로도 가능
v2 <- v1
v1; v2


# 문제2
# 10 에서 38사이의 숫자 중에서 2씩 증가한 값으로 벡터를 생성하여 v 라는 변수에 저장
v <- seq(10, 38, by=2)

# v 를 가지고 3행 5열의 매트릭스를 만들어 m1 에 저장한다.(행 우선 저장)
m1 <- matrix(v, 3, 5, byrow=T)

# 각 원소 값들에 100을 더한 결과로 매트릭스 m2 를 만든다.
m2 <- m1+100

# m1 에서 최대값을 추출하여 m_max_v 에 저장한다.                     
m_max_v <- max(m1)

# m1 에서 최소값을 추출하여 m_min_v 에 저장한다.   
m_min_v <- min(m1)

# m1 에서 행 단위의 최대값을 추출하여 row_max 에 저장한다.
row_max <- apply(m1, 1, max)
  
# m1 에서 열 단위의 최대값을 추출하여 col_max 에 저장한다.
col_max <- apply(m1, 2, max)

# m1, m2, m_max_v, m_min_v, row_max, col_max를 화면에 출력한다.
m1; m2; m_max_v; m_min_v; row_max; col_max



# 문제3
# 1,2,3 의 벡터 n1, 4,5,6 의 벡터 n2, 7,8,9 의 벡터 n3 를 이용하여 matrix를 생성
n1 <- c(1:3)
n2 <- c(4:6)
n3 <- c(7:9)

m2 <- cbind(n1,n2,n3); m2


# 문제4
# 1~9 의 벡터를 이용하여 matrix를 m3에 저장하고 출력
m3 <- matrix(1:9, 3,3, byrow = T); m3


# 문제5
# m3 를 가지고 다음과 같이 값이 구성되는 매트릭스를 정의하여 m4 에 저장하고 출력한다
rownames(m3) <- c("row1","row2","row3")
colnames(m3) <- c("col1","col2","col3")
m4 <- m3; m4


# 문제6
# 2행 3열 매트릭스 alpha를 생성한 후
alpha <- matrix(letters[1:6],2,3)

# alpha에 ‘x’, ‘y’, ‘z’ 라는 행을 추가하여 alpha2 를 만들고 출력
alpha2 <- rbind(alpha, c('x','y','z')); alpha2

# alpha에 ‘s’, ‘p’ 라는 열을 추가하여 alpha3 를 만들고 출력
alpha3 <- cbind(alpha, c('s','q')); alpha3



# 문제7
a <- array(1:24, dim=c(2,3,4))

# 2행3열4층의 데이터를 출력한다.
a[2,3,4]

# 각 층마다 2행의 데이터를 출력한다.
a[2,,]

# 각 층마다 1열의 데이터를 출력한다.
a[,1,]

# 3층의 모든 데이터를 출력한다.
a[,,3]

# a라는 배열을 구성하는 모든 데이터에 100을 + 연산하여 출력한다.
a +100

# 4층의 모든 데이터들에 100을 곱한 결과를 출력한다.
a[,,4] *100

# 각층의 1행, 2열과3열만 출력한다.
a[1,2:3,]

# 2층의 2행 데이터들의 값을 100을 더한 값으로 변경한다.
a[2,,2] <- a[2,,2] +100

# 1층의 모든 데이터들의 값에 2를 뺀 값으로 변경한다.
a[,,1] <- a[,,1]-2

# a 배열의 모든 데이터 값들을 10을 곱한 값으로 변경한다.
a <- a*10

# a 배열을 삭제한다.
rm(a)