# 문제1
# 함수 exam1( )을 생성한다.
# 매개변수 : 없음, 리턴 값 :  1개
# 기능 : “Aa” “Bb” ~ “Zz” 등으로 구성된 벡터를 리턴한다.
# 결과 출력은 함수를 호출한 다음 리턴 값을 받아서 호출한 쪽에서 한다.
exam1 <- function() {
  return (paste(LETTERS,letters,sep=""))
}
exam1()


# 문제2
# 함수 exam2( )을 생성한다.
# 매개변수 : 1 개, 리턴 값 :  1개
# 기능 : 아규먼트로 숫자 한 개를 받는다. 
# 1 부터 이 숫자 값까지의 합을 구해서 리턴한다.
# 결과 출력은 함수를 호출한 다음 리턴 값을 받아서 호출한 쪽에서 한다.

exam2 <- function(n){
  sum <- 0
  return (sum(1:n))
}
exam2(5)


# 문제3
# 함수 exam3( )을 생성한다.
# 매개변수 : 2 개, 리턴 값 :  1개
# 기능 : 전달받은 2개의 데이터 중에서 큰 값에서 작은 값의 차를 리턴, 두 값이 동일하면 0 을 리턴한다.

# 결과 출력은 함수를 호출한 다음 리턴 값을 받아서 호출한 쪽에서 한다.

exam3 <- function(n1,n2){
  if (n1 <= n2){
    result <- n2 - n1
  }
  else{
    result <- n1 - n2}
  return (result)}

exam3(5,6)
exam3(7,3)
exam3(4,4)


# 문제4
# 함수 exam4( )를 생성한다.
# 매개변수 : 3 개, 리턴 값 :  1개
# 기능 : 아규먼트를 숫자 연산자 숫자 순으로 전달받는다. (연산자는 +, -, *, %/%, %% 를 받는 것으로 정한다)
# 전달된 두 개의 숫자에 대하여 연산을 처리하고 그 결과를 리턴한다.
# 단,다른 연산자가 전달되면 "규격의 연산자만 전달하세요"를 리턴한다.
# %/% 와 %%  가 전달된 경우에 한해서 첫 번째 숫자가 0이면 "오류1" 이라고 리턴한다.
# %/% 와 %%  가 전달된 경우에 한해서 두 번째 숫자가 0이면 "오류2" 라고 리턴한다.
# 함수를 호출하여 리턴된 결과를 출력하는 것은 호출한 쪽에서 한다.

exam4 <- function(n1,c,n2){
  result <- 0
  if(c == "+"){
    result <- n1 + n2
  }else if(c == "-"){
    if(n1 >= n2){
      result <- n1 - n2
    }
    else{
      result <- n2 - n1
    }
  }else if(c == "*"){
    result <- n1 * n2
    }else if(c == "%/%" | c == "%%"){
    if(n1 == 0){
      result <-"오류1"
    }
    else if(n2 ==0) {
      result <-"오류2"
    }else{
      if(c=="%/%"){
      result <- n1 %/% n2}
      else{
        result <- n1 %% n2
      }}
  }else{
    return("규격의 연산자만 전달하세요")
  }
  return(result)
}

exam4(2,"+",4)
exam4(5,"-",3)
exam4(3,"*",3)
exam4(8,"%/%",3)
exam4(0,"%/%",3)
exam4(8,"%%",3)
exam4(8,"%%",0)
exam4(1,"=",6)



# 문제5
# 함수 exam5( )을 생성한다.
# 매개변수 : 2 개(한 개는 필수, 또 다른 한 개는 선택(기본값 설정),리턴 값 :  없음(NULL 리턴)
# 기능 : 첫 번째 아규먼트는 숫자를 두번째 아규먼트는 문자를 입력받아서 숫자의 개수만큼 문자를 출력하는 기능을 처리한다.(행바꿈 없이) 
# 문자가 전달되지 않으면 기본값은 "#" 로 처리한다. 
# 숫자로 음의 값이 전달되면 아무것도 출력하지 않는다.
            
exam5 <- function(a, b="#"){
  i <- 0
  if(a > 0){
      for(i in 1:a){
        cat(b)}
  } # else{return()} null도 출력x
}

exam5(0,"^")
exam5(5,"&")
exam5(6)
exam5(-1)



# 문제6
# 함수 exam6( )를 생성한다.
# 매개변수 : 1 개, 리턴 값 :  없음(NULL 리턴)
# 기능 : 아규먼트로 전달되는 벡터에는 학생들의 점수(0~100)가 들어 있다.점수에 따라서 결과를 출력한다.
# 85~100 "상", 70~84  "중", ~69    "하"
# 출력형식 : "xx 점은 x등급입니다." 
# NA 값이 존재하는 경우엔 "NA 는 처리불가" 를 출력한다.
# 모든 출력은 print() 함수를 사용한다.

exam6 <- function(x){
  for(i in 1:length(x)){
  if(is.na(x[i]))
    print("NA는 처리불가") # na에 대해 먼저 정의해야 오류 안뜸
  else if(x[i] >= 85)
    print(paste(x[i],"점은 상등급입니다.")) # print함수는 하나의 식만 출력 가능
  else if(x[i] >= 70)
    print(paste(x[i],"점은 중등급입니다."))
  else
    print(paste(x[i],"점은 하등급입니다."))
 }
}


exam6(NA)
exam6(80)
exam6(50)
exam6(70)
exam6(96)
exam6(35)
exam6(c(80, 50, 70, 66, NA, 35))