# [ OPEN API 실습 1 ] 
# 네이버의 블로그에서 “맛집” 이라는 단어가 들어간 글들을 검색하여 100개까지 추출한 다음 naverblog.txt 파일로 저장하시오.
# 단, XML 형식의 요청을 처리한다.




# [ OPEN API 실습 2 ] 
# 트위터에서  “코로나” 이라는 단어가 들어간 트윗 글들을 검색하여 100개까지 추출한 다음 twitter.txt 파일로 저장하시오.
# 제거해야 하는 문자 : 특수문자, 영어
# 제거해야 하는 행 : NA값만 있는 행




# [ OPEN API 실습 3 ] 
# 공공DB에서 360번 차량에 대하여 정보를 추출한 다음 노선ID, 노선길이, 기점, 종점, 배차간격을 다음 형식으로 출력하시오.

# [ 360번 버스정보 ]
# 노선ID : xxx
# 노선길이 : xxx
# 기점 : xxx
# 종점 : xxx
# 배차간격 : xxx
# 참고 : http://api.bus.go.kr/contents/sub02/getBusRouteList.html

# [ OPEN API 실습 4 ] 
# 네이버의 뉴스에서 “빅데이터” 라는 단어가 들어간 뉴스글들을 검색하여 100개까지 추출한 다음 
# 뉴스 제목을 추출하여 navernews.txt 파일로 저장하시오.
# 단, JSON 형식의 요청을 처리한다.
# 제거해야 하는 문자들 : <b>, </b>, &quot;, &gt;

